n5/src/Documents/PayrollBalances/PayrollBalances.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>PayrollBalances</name>
  <registerRecords>AccountingRegister.General</registerRecords>
  <attributes>
    <name>Amount</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Company</name>
    <type>
      <types>CatalogRef.Companies</types>
    </type>
  </attributes>
  <attributes>
    <name>Creator</name>
    <type>
      <types>CatalogRef.Users</types>
    </type>
  </attributes>
  <attributes>
    <name>Memo</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Employees</name>
    <attributes>
      <name>Account</name>
      <type>
        <types>ChartOfAccountsRef.General</types>
      </type>
    </attributes>
    <attributes>
      <name>Balance</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Compensation</name>
      <type>
        <types>ChartOfCalculationTypesRef.Compensations</types>
      </type>
    </attributes>
    <attributes>
      <name>Deductions</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Employee</name>
      <type>
        <types>CatalogRef.Employees</types>
      </type>
    </attributes>
    <attributes>
      <name>Individual</name>
      <type>
        <types>CatalogRef.Individuals</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

n5/src/Documents/PayrollBalances/ManagerModule.bsl
#if ( Server or ThickClientOrdinaryApplication or ExternalConnection ) then

Procedure PresentationFieldsGetProcessing ( Fields, StandardProcessing )
	
	DocumentPresentation.StandardFields ( Fields, StandardProcessing );

EndProcedure

Procedure PresentationGetProcessing ( Data, Presentation, StandardProcessing )
	
	DocumentPresentation.StandardPresentation ( Metadata.Documents.PayrollBalances.Synonym, Data, Presentation, StandardProcessing );
	
EndProcedure

#region Posting

Function Post ( Env ) export
	
	getData ( Env );
	commit ( Env );
	flagRegisters ( Env );
	return true;
	
EndFunction

Procedure getData ( Env )

	sqlFields ( Env );
	sqlEmployees ( Env );
	getFields ( Env );
	
EndProcedure

Procedure sqlFields ( Env )
	
	s = "
	|// @Fields
	|select dateadd ( Documents.Date, second, - 1 ) as Date, Documents.Company as Company
	|from Document.PayrollBalances as Documents
	|where Documents.Ref = &Ref
	|";
	Env.Selection.Add ( s );
	
EndProcedure

Procedure sqlEmployees ( Env )
	
	s = "
	|// #Employees
	|select Employees.Account as Account, Employees.Compensation as Compensation,
	|	Employees.Individual as Employee, Employees.Balance as Balance
	|from Document.PayrollBalances.Employees as Employees
	|where Employees.Ref = &Ref
	|";
	Env.Selection.Add ( s );
	
EndProcedure

Procedure getFields ( Env )
	
	Env.Q.SetParameter ( "Ref", Env.Ref );
	SQL.Perform ( Env );
	
EndProcedure 

Procedure commit ( Env )
	
	p = GeneralRecords.GetParams ();
	fields = Env.Fields;
	p.Date = fields.Date;
	p.Company = fields.Company;
	p.Recordset = Env.Registers.General;
	for each row in Env.Employees do
		commitCompensation ( p, row );
	enddo; 
	
EndProcedure 

Procedure commitCompensation ( Params, Row )
	
	zero = ChartsOfAccounts.General._0;
	account = Row.Account;
	employee = Row.Employee;
	compensation = Row.Compensation;
	balance = Row.Balance;
	if ( balance <> 0 ) then
		Params.AccountDr = zero;
		Params.AccountCr = account;
		Params.Amount = balance;
		Params.DimCr1 = employee;
		Params.DimCr2 = compensation;
		GeneralRecords.Add ( Params );
	endif;
	
EndProcedure 

Procedure flagRegisters ( Env )
	
	general = Env.Registers.General;
	general.Write = true;
	
EndProcedure

#endregion

#endif
